<div class="bg-white p-4 rounded shadow-sm mb-4">
    <p>
        <strong>Полигон</strong> - это географическая зона, используемая для оптимизации доставки и логистики. Полигон может представлять собой город, район, улицу или любое другое географическое разделение. <strong>Типы полигонов</strong> используются для настройки условий доставки в магазинах. Эти типы полигонов подразделяются на различные категории, каждая из которых характеризует особые условия и время доставки.
    </p>
    <p>
        <strong>Использование полигонов:</strong> эти типы полигонов настраиваются в административной панели для каждого конкретного магазина. При настройке типов полигонов важно учитывать рабочий график и возможности доставки магазина. Данные полигоны также играют важную роль в другом разделе админ-панели, а именно в "Магазины". В этом разделе при конфигурировании конкретного магазина вы можете привязывать определённые типы полигонов к конкретным дням недели работы магазина, что позволит более гибко управлять процессом доставки и улучшит сервис для клиентов.
    </p>
</div>
