<?php

namespace Database\Seeders;

use Domain\Store\Models\ProductStore;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductTestLeftoversSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $store1cId = '24592c61-247b-4c05-aca8-47ad8a1566a4';

        $product1cIds = [
            'a988cc67-ad0f-11ed-8000-20677c074218', // 13 Пирожное бисквитное MILKA Шоколадный перекус 116гр (368) 1*14
            '67c911ce-b729-11ed-8002-20677c074218', // 190 Электрофумигатор ТАЙГА (622) 1*60
            '5595ac85-b96b-11ed-8002-20677c074218', // 236 Колготки женские 40ден Incanto Active Body ,5 daino (221)
            '4f54f75c-c3d6-11ed-8004-20677c074218', // 363 Лапша б/п Мясо говядины с различными овощами (пакет) 106гр (079) 1*5
            '998c60f7-c6f2-11ed-8005-20677c074218', // 416 Масло сливочное шоколадное Продукты из Елани 62% 180гр (906) 1*24
            '6dcd9014-b3d5-11de-8007-000e0c4b16fe', // 449 Паста томатная САНФИЛ 140гр ж/б (184/326) 1*50
            'cf2c848c-1dce-11db-8071-0014c244c4f0', // 1513 Каша Heinz Молочная рисовая 200гр (013) 1*7
            'b3caaf93-df1d-11ed-800e-20677c074218', // 1058 Йогурт ФРУГУРТ Клубника Малина 2% 240гр (341) 1*12
            'ad3c3a59-c041-11ea-bf68-20677c074218', // 59172 Конфеты Степ Лесной орех с арахисом и фундуком 192гр Славянка (747) 1*10
            'd6bceb9a-05c8-11dc-9a06-0018fe77669f', // 36657 Кофе Капучино 300 мл Нэскафе
            'caf653b9-977b-11eb-bf8e-20677c07421c', // 65775 Ролик-каток для пресса метал/пластм (2-колёсный,в/к) арт.JS3001 ACTIVE WAY (365)
            'a2e88cf9-0785-11e6-811c-d89d6716ead7', // 3951 Говядина тушеная в/с Гост 338гр Елинский ПК (549/823) 1*12
            'd5abaeba-e304-11e4-9467-d89d6716ead5', // 35126 Мангал+шампур 6шт метал 50*30*50см (в/к) "Дачник" Метиз арт.707235 (009)
            'bc6513bd-0214-11eb-bf73-20677c07421c', // 61268 ПН КОМПЛИМЕНТ Silk Skin для рук (Крем-шелк д/рук 200мл + Соль эвк. 100гр + Соль берг. 100гр) (478) 1
            '62eb5bc0-cd34-11e9-82d6-d89d6716ead6', // 28163 Трусы д/девочек х-95% э-5% р.28-30 (110-116) (белый,кролик,е/п) арт.GB-1901 «IV» (659)
            '015b3df0-c762-11ec-bfbc-20677c074218', // 74751 Шашлык из свинины Гриль Микс в ведре 1,8кг
            '658f8afb-d28e-11ed-8009-20677c074218', // 694  Чипсы BRUTO Крафт Картошка черный перец 70гр (056) 1*16
            '52a3e185-0d01-11eb-bf74-20677c074218', // 61656  Кружка керам 350мл (с рис бычка) "Чудеса случаются" арт.200-08076 OLAFF (347)
            'fada2401-6623-11e7-8160-d89d6716ead7', // 10555 Полотенце махровое х-100% 50*90см (микс,в/п,б/е) "Cleanelly" арт.ПЦ-2672-2126 (788)
            '4e6a74c5-1f9e-11ee-9f67-000c29efa3d9', // 39634 Десерт творожный А.РОСТАГРОКОМПЛЕКС Чизкейк клубничный БЗМЖ 40гр (974) 1*12
            'aec9e4e5-f68b-11e7-819a-d89d6716ead7', // 15624 Мармелад жевательный МАМБА Фрумелад фруктовый микс 72гр Шторк (905) 1*24
            'da9da258-be0c-11e7-8186-d89d6716ead6', // 13850 Новогодний подарок НОВОГОДНЯЯ СКАЗКА овал 1200гр жесть
            '8b02913f-3f57-11e6-811f-d89d6716ead7', // 9135 Игрушка мягкая 22см (c копилкой, музык, микс) "Петух"  арт.BLNG05-16-311 OD
            '38586666-4c7d-11e9-8244-d89d6716ead7', // 24546 Конструктор пластм 25*16*5см (149дет,фигурки,в/к,б/е) «Аквамир: Морские исследователи» арт.KK-3305-R
            '2e44d71f-4dbd-11e3-93fc-d89d6716ead5', // 31675 Новогодний подарок Аленка. Подарок на елку Сказочный Домик 185гр 1*8 Кр. Октябрь
            'a805d8a7-8725-11e9-8288-d89d6716ead7', // 26099 Печенье злаковое ЮБИЛЕЙНОЕ с яблочными кусочками 171гр Большевик (150) 1*14
            '9d4ef5b5-275c-11ed-bfd4-20677c074218', // 77540 ПН BISOU Face Matting Set Гель д/умывания Очищение и свежесть 150мл+Крем-сыворотка Гидраматирующая 5
            '6ac7146e-62c4-11e7-8160-d89d6716ead7', // 10482 Колготки женские 240ден 3 (nero,thermo bamboo,в/п,б/е) "Argento vivo" (156)
        ];

        foreach ($product1cIds as $product1cId) {
            $leftover = ProductStore::query()
                ->where('product_system_id', $product1cId)
                ->where('store_system_id', $store1cId)->first() ?? new ProductStore();

            $leftover->fill([
                'hash' => md5($store1cId . $product1cId),
                'store_system_id'   => $store1cId,
                'product_system_id' => $product1cId,
                'active'            => true,
                'price'             => rand(50, 1999),
                'price_discount'    => 0,
                'count'             => rand(1, 100),
                'delivery_schedule' => [],

            ]);

            $leftover->save();
        }
    }
}
